app/views/visitors/index.html.erb

<% if user_signed_in? %>
	<p><%#= link_to 'Users:', users_path %> <%#= User.count %> </p>
---
SELECT COUNT(*) FROM "users"


	 <% DoctorCategory.all.each do |doctor_category| %>
---
SELECT "doctor_categories".* FROM "doctor_categories"

        <% end %></li>
		    <li class="list-group-item"><span class="badge"><%= doctor_category.doctors.active.count %></span>
---
SELECT COUNT(*) FROM "doctors" WHERE "doctors"."doctor_category_id" = $1  [["doctor_category_id", 12]]