app/controllers/doctor_categories_controller.rb

SELECT "doctor_categories".* FROM "doctor_categories"
---
def index
	@doctor_categories = DoctorCategory.all

INSERT INTO "doctor_categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hgh"], ["created_at", "2016-03-16 06:36:30.898266"], ["updated_at", "2016-03-16 06:36:30.898266"]]
---
def create
	@doctor_category = DoctorCategory.new(doctor_category_params)

	respond_to do |format|
		if @doctor_category.save

UPDATE "doctor_categories" SET "name" = $1, "updated_at" = $2 WHERE "doctor_categories"."id" = $3  [["name", "GFG"], ["updated_at", "2016-03-16 06:42:03.403180"], ["id", 1]]
---
def update
    respond_to do |format|
      if @doctor_category.update(doctor_category_params)

DELETE FROM "doctor_categories" WHERE "doctor_categories"."id" = $1  [["id", 1]]
---
  def destroy
    @doctor_category.destroy

SELECT  "doctor_categories".* FROM "doctor_categories" WHERE "doctor_categories"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_doctor_category
      @doctor_category = DoctorCategory.find(params[:id])