app/controllers/doctors_controller.rb

    def set_doctor
      @doctor = Doctor.find(params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1  ORDER BY "doctors"."id" ASC LIMIT 1  [["id", 2]]