app/controllers/visitors_controller.rb

	def index
		if doctor_signed_in?
			@doctor = Doctor.find(current_doctor.id)
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1  ORDER BY "doctors"."id" ASC LIMIT 1  [["id", 2]]